.emacs.d/config.org
#+TITLE: Emacs configuration
#+AUTHOR: Mikael Zhang

* Custom variables and faces

#+BEGIN_SRC emacs-lisp
(custom-set-variables
 ;; custom-set-variables was added by Custom.
 ;; (add-p(linum-on)rojectsto-list 'dashboard-items '(agenda) t)If you edit it by hand, you could mess it up, so be careful.
 ;; Your init file should contain only one such instance.
 ;; If there is more than one, they won't work right.
 '(inhibit-startup-screen t)
 '(package-selected-packages
   (quote
    (pallet package-build shut-up epl git commander f dash s))))
(custom-set-faces
 ;; custom-set-faces was added by Custom.
 ;; If you edit it by hand, you could mess it up, so be careful.
 ;; Your init file should contain only one such instance.
 ;; If there is more than one, they won't work right.
 )
#+END_SRC

* Emacs internal configuration
** Indent
#+BEGIN_SRC emacs-lisp
(setq tab-width 4)
#+END_SRC
** Unset Control Z
#+BEGIN_SRC emacs-lisp
(global-unset-key (kbd "C-z"))
#+END_SRC

** Line numbers
#+BEGIN_SRC emacs-lisp
(linum-on)
#+END_SRC
* org-mode configuration
** Beamer org export

#+BEGIN_SRC emacs-lisp
(require 'ox-beamer)
#+END_SRC

** Support Shift Select

#+BEGIN_SRC emacs-lisp
(setq org-support-shift-select t)
#+END_SRC

** Saving Emacs Sessions - NOT IN USE
https://www.gnu.org/software/emacs/manual/html_node/emacs/Saving-Emacs-Sessions.html
#+BEGIN_SRC emacs-lisp
;;(desktop-save-mode 1)
#+END_SRC
* org-bullets
https://github.com/sabof/org-bullets
#+BEGIN_SRC emacs-lisp
(add-hook 'org-mode-hook (lambda () (org-bullets-mode 1)))
#+END_SRC
* Themes
** doom-themes - NOT IN USE
https://github.com/hlissner/emacs-doom-themes#install
#+BEGIN_SRC emacs-lisp
;(require 'doom-themes)
;(load-theme 'doom-spacegrey t)
#+END_SRC

** Tomorrow Night Bright - NOT IN USE
#+BEGIN_SRC emacs-lisp
;;(load-theme 'sanityinc-tomorrow-bright t)
#+END_SRC
** (Built in) Manoj dark
#+BEGIN_SRC emacs-lisp
(load-theme 'manoj-dark t)
#+END_SRC
* YASnippet
https://github.com/joaotavora/yasnippet
#+BEGIN_SRC emacs-lisp
(require 'yasnippet)
(yas-reload-all)
;;Add hook for prog-mode and org-mode
(add-hook 'prog-mode-hook #'yas-minor-mode)
(add-hook 'org-mode-hook #'yas-minor-mode)
(add-hook 'latex-mode-hook #'yas-minor-mode)
#+END_SRC
* FlySpell
* ob-sagemath
https://github.com/stakemori/ob-sagemath

#+BEGIN_SRC emacs-lisp
;; Ob-sagemath supports only evaluating with a session.
(setq org-babel-default-header-args:sage '((:session . t)
                                           (:results . "output")))

;; C-c c for asynchronous evaluating (only for SageMath code blocks).
(with-eval-after-load "org"
  (define-key org-mode-map (kbd "C-c c") 'ob-sagemath-execute-async))

;; Do not confirm before evaluation
(setq org-confirm-babel-evaluate nil)

;; Show images when opening a file.
(setq org-startup-with-inline-images t)
#+END_SRC

* auto-complete
https://github.com/auto-complete/auto-complete
#+BEGIN_SRC emacs-lisp
(ac-config-default)
#+END_SRC
** auto-complete-sage
https://github.com/stakemori/auto-complete-sage
#+BEGIN_SRC emacs-lisp
(add-hook 'sage-shell:sage-mode-hook 'ac-sage-setup)
(add-hook 'sage-shell-mode-hook 'ac-sage-setup)
;; Show quick help
(setq ac-sage-show-quick-help t)
#+END_SRC
* Magit
https://github.com/magit/magit
#+BEGIN_SRC emacs-lisp
(global-set-key (kbd "C-x g") 'magit-status)
#+END_SRC
* Emacs-dashboard
https://github.com/rakanalh/emacs-dashboard

#+BEGIN_SRC emacs-lisp
(require 'dashboard)
(dashboard-setup-startup-hook)
;;(setq dashboard-items '((recents  . 5)
;;                        (bookmarks . 5)))

(setq dashboard-items '((recents  . 5)))
#+END_SRC
* Beacon
https://github.com/Malabarba/beacon
#+BEGIN_SRC emacs-lisp
(beacon-mode 1)
#+END_SRC
* linum-relative
https://github.com/coldnew/linum-relative

#+BEGIN_SRC emacs-lisp
(require 'linum-relative)
;; Use `display-line-number-mode` as linum-mode's backend for smooth performance
(setq linum-relative-backend 'display-line-numbers-mode)
#+END_SRC

* Treemacs
https://github.com/Alexander-Miller/treemacs
